
* AOC 2023 Day 10

** Initialize 
#+BEGIN_SRC elisp
  (pyvenv-activate "~/projects/project_venv/")
  ; This is needed to make sure python indentation isn't messed up
  (setq org-src-preserve-indentation t)
#+END_SRC

** Day 10 star 1
*** Problem statement
If the animal had entered this loop in the northwest corner, the sketch would instead look like this:

.....
.S-7.
.|.|.
.L-J.
.....

*** Notes
- A graph
- Need to enumerate over all paths, find largest
- Not acyclic
- Each pipe only has _one_ connection
    
*** Solution
#+BEGIN_SRC python :results output
import re
from pydantic import BaseModel
from d10_utils import P,S

MAPPINGS = {"|": (P(x=0,y=-1),P(x=0,y=1)),
            "-": (P(x=1,y=0),P(x=-1,y=0)),
            "L": (P(x=1,y=0),P(x=0,y=-1)),
            "J": (P(x=-1,y=0),P(x=0,y=-1)),
            "7": (P(x=-1,y=0),P(x=0,y=1)),
            "F": (P(x=1,y=0),P(x=0,y=1))}

class Grid(BaseModel):
    size: S
    cells: dict[P, str]
    start: P

    def connect(self, p1: P, p2: P):
        c = self.cells[P1]
        for mapping in MAPPINGS.get(c,()):
            if mapping + p1 == p2:
                return True

        return False

    def in_bounds(self,p: P) -> bool:
        return p.x >=0 and p.y >=0 and p.x < self.size.width and p.y < self.size.height
    
    def connected_points(self, p1: P) -> list:
        points = []
        c = self.cells[p1]
        for mapping in MAPPINGS.get(c,()):
            p2 = p1 + mapping
            if self.in_bounds(p2):
                points.append(p2)

        return points
    
def load_grid(path: str) -> Grid:
  cells = {}
  width,height = 0,0
  start = P()
  with open(path,'r') as f:
    for y, row in enumerate(f.read().split("\n")):
      if row:
        width = len(row)
        height +=1 
        for x, col in enumerate(row.strip()):
          p = P(x=x,y=y)
          if col == 'S':
              start = p
          cells[p] = col

  return Grid(size=S(width=width,height=height),cells=cells, start=start)

def dump(grid: Grid):
  print("Starting at",grid.start)
  for y in range(0,grid.size.height):
    s = ""
    for x in range(0,grid.size.width):
      s+=grid.cells.get(P(x=x,y=y)) or '.'
    print(s)

def star_1(path: str, start_char: str) -> int:
  grid = load_grid(path)
  grid.cells[grid.start] = start_char
  
  visited: dict[P,bool] = {grid.start: 0}
  max_depth = 0
  p = grid.start
  to_visit = [*grid.connected_points(p)]

  # use DFS to find the path
  counter = 0
  path = [p]
  while len(to_visit) and counter < 1000:
      counter+=1
      p2 = to_visit[0]#.pop()
      del to_visit[0]
      if not visited.get(p2):
          visited[p2] = True
          #print('Visited',p2,grid.cells[p2],'from',p,visited[p2])
          to_visit.extend([np for np in grid.connected_points(p2) if not visited.get(np)])
          path.append(p2)

  pg = Grid(size=grid.size, cells={}, start=P())
  for p in path:
      if p == grid.start:
          pg.cells[p] = '*'
      else:
          pg.cells[p] = grid.cells[p]

  #print(grid)
  print(len(path),len(path)/2)
  dump(pg)
      
  return len(path)/2
  
#star_1("sample.txt","F")
#star_1("sample_2.txt","F")
star_1("input.txt","L")
#+END_SRC

#+RESULTS:
#+begin_example
1000 500.0
Starting at x=0 y=0 z=0
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
.........F--7...............................................................................................................................
.........L-7|...........F7F7................................................................................................................
.......F---J|...........||||................................................................................................................
.......L---7L7.........FJLJL-7.........7....................................................................................................
...........L7|..F7F----JF7F-7L--7F-----J....................................................................................................
.........F--JL7.||L-----J||.L--7LJF---7F7F7F7F--7...F7.....F7...............................................................................
.........L-7F7L-JL7F7F7F7LJF7F7L-7|F--J|LJLJLJF-J...||F7F--JL-7.............................................................................
........F7.LJ|F7F7LJLJLJL-7|LJL-7LJL---JF7F---JF7.F7|LJ||F--7FJ.............................................................................
........|L--7LJLJL-------7|L---7|F7F----JLJF---JL-JLJF7LJL-7LJ..............................................................................
........L--7|.F7F--7F----JL---7|||LJF7.F---JF--7F-7F7|L7F7FJF7..............................................................................
........F--JL7|LJF7LJF7F-7F7F7LJ|L--JL-JF--7L-7||FJ|||FJ||L-JL-7............................................................................
........|F--7|L7FJ*7FJLJ.||||L-7L---7F-7|F7L--JLJL-JLJ|FJ|F----J............................................................................
........LJF-JL-J|F-J|F---J|||F-JF7F7LJ.|LJL--7F7F7F--7LJFJL--7F7............................................................................
..........|F-7F-JL-7|L----JLJL--JLJL--7L--7F7LJLJLJF-JF7L---7LJL7...........................................................................
..........LJ.||F--7||F-----7F7F7F-7F-7L--7LJL--7F--JF7|L---7L7F-J...........................................................................
.............|||F7LJ|L----7|||||L7|L7L7F7|.F7F7LJF7.|LJF7F-J.LJ.............................................................................
.............LJLJL--J.F---JLJLJL-JL-J.|||L-JLJL-7|L7|F-JLJF-7...............................................................................
......................L7F7F7F-7F7F---7LJL--7F---JL7||L7F7FJFJ...............................................................................
......................FJ|LJLJ.LJ|L7F-JF7.F7||F--7FJ||FJ|||FJ................................................................................
......................L-J.F----7L-JL-7||FJ|LJ|F-JL7LJL7|LJL7................................................................................
........................F-JF7F7L-----J||L7L7.||F--JF7FJ|F7FJ................................................................................
........................|F-JLJL-----7FJ|FJFJFJLJF7FJLJ.||LJ.................................................................................
........................LJ...F------J|FJL7|.L7F-JLJF---JL--7................................................................................
.............................L-7F----JL--JL7FJL7F7.L-7F----J................................................................................
...............................LJ..........LJF-J||F7.|L--7..................................................................................
.............................................L7FJLJL-JF-7L7.................................................................................
..............................................LJF----7L7L-J.................................................................................
...............................................7L---7|FJ....................................................................................
...............................................L7F7FJ||.....................................................................................
................................................LJ|L7||.....................................................................................
..................................................L-JLJ.....................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
............................................................................................................................................
#+end_example



** Day 10 star 2
*** Problem statement
*** Solution
#+BEGIN_SRC python :results output
def star_2(data: Data) -> int:
  with open(path,'r') as f:
     pass
  return 0
  
return star_2("sample.txt")
#+END_SRC

